content/posts/zhao2017.md
+++
title = "zhao2017 | Path smoothing for five-axis machine tools using dual quaternion approximation with dominant points"
author = ["João Gutemberg Farias"]
draft = false
+++

The paper proposes a dual quaternion B-Spline approximation method for using in five-axis CNC machines. The advantages of the method are: reduced computation time, reduced storage consuption, reduced number of control points. Also using the dual quaternionic method can eliminate the fitting oscillatory and solve the parameter synchronization problem simultaneously (no idea what this two mean).


## Info {#info}


## Notes {#notes}


### Resumo {#resumo}

The paper proposes a dual quaternion B-Spline approximation method for using in five-axis CNC machines. The advantages of the method are: reduced computation time, reduced storage consuption, reduced number of control points. Also using the dual quaternionic method can eliminate the fitting oscillatory and solve the parameter synchronization problem simultaneously (no idea what this two mean).
